---
title: FabricWireItem
classe: Autodesk.Revit.DB.Structure.FabricWireItem
namespace: Autodesk.Revit.DB.Structure
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# FabricWireItem

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double Distance { get; set; }` | `fabricWireItem.Distance` | Double |
| `Boolean IsValidObject { get; }` | `fabricWireItem.IsValidObject` | Boolean |
| `Double OffsetAlongWire { get; set; }` | `fabricWireItem.OffsetAlongWire` | Double |
| `Double WireLength { get; set; }` | `fabricWireItem.WireLength` | Double |
| `ElementId WireType { get; set; }` | `fabricWireItem.WireType` | ElementId |
| `FabricWireItem Create(Double, Double, ElementId, Double)` | `FabricWireItem.Create(distance, wireLength, wireType, wireOffset)` | FabricWireItem |
| `Void Dispose()` | `fabricWireItem.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```